Тест_ЗУП_31_КОРП/src/Enums/ТипыТестовыхВопросов/ТипыТестовыхВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТестовыхВопросов</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ТипыТестовыхВопросов/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	ЭлектронноеОбучениеСлужебный.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыТестовыхВопросов", СтандартнаяОбработка);	
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТипВопросаВСтроку(ТипВопроса) Экспорт
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих Тогда
		Возврат "SINGLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих Тогда
		Возврат "MULTIPLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность Тогда
		Возврат "SEQUENCE";
	КонецЕсли;	
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецЕсли
